###################################################################################
# 1. Что такое список


###################################################################################
# 2. Что такое список?


###################################################################################
# 3. Программист, разрабатывающий приложение для
# хранения документов в строительной компании,
# должен предусмотреть в приложении возможность
# вывода информации о документе в консоль.
# Номер договора имеет формат 20А-21Б, причем должен содержать
# только заглавные буквы, Фамилия, имя составителя должны начинаться
# с Заглавной буквы, остальные строчные,
# Тип документа должен быть выведен только строчными буквами.
# На каждый параметр необходимо создать отдельную переменную.
# Вывести результат в консоль


###################################################################################
# 4. Имеются данные о продажах некоторого магазина:
# Товары, которые продавала аптека на неделе:
# Картон (300 руб, купили 10 раз),
# Бумага (500 руб, купили 6 раз),
# Ножницы (124 руб, купили 12 раз),
# Папка (750 руб, купили 4 раза),
# Набор профессиональной акварели (567 руб, купили 5 раз),
# Подставка-котик (320 руб., купили 20 раз).
# Необходимо создать файл csv, который содержит название товара,
# стоимость и количество покупок,
# разработать приложение (использовать словари),
# чтобы на выходе можно было получить средние количество продаж,
# выручке, ценах, а также максимальное и минимальное значение,
# самый продаваемый товар, самый непопулярный товар.
# Всю статистику необходимо вывести в консоль и сохранить в отдельный файл.
